<a href="https://colab.research.google.com/github/GYIKOO/UCIMLHackathon21/blob/main/EDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [ ]:
import os
path = os.getcwd()
path

'/content'

In [4]:
df = pd.read_csv('/content/covid_lies.csv')

In [ ]:
df.head()

   misconception_id  ... label
0                 3  ...    na
1                30  ...    na
2                57  ...    na
3                22  ...    na
4                32  ...    na

[5 rows x 5 columns]

## misconception_id

In [ ]:
df.groupby('misconception_id')['tweet'].count()\
                  .reset_index(name='count') \
                  .sort_values(['count'], ascending=False).reset_index(drop=True)

    misconception_id  count
0                  3    286
1                 25    192
2                 10    188
3                 15    145
4                  1    100
..               ...    ...
57                52     99
58                13     99
59                32     99
60                39     98
61                38     90

[62 rows x 2 columns]

## tweet_id

In [5]:
df.groupby('tweet_id')['tweet'].count()\
              .reset_index(name='count') \
              .sort_values(['count'], ascending=False).reset_index(drop=True)

                 tweet_id  count
0     1233993662952067072     17
1     1233915761170747392     14
2     1233942556909744128     11
3     1233951518761639936     10
4     1233985635066744832      9
...                   ...    ...
4366  1233945591387836416      1
4367  1233916973110693888      1
4368  1233945660262699008      1
4369  1233945662556950528      1
4370  1233997840084434944      1

[4371 rows x 2 columns]

## label

In [ ]:
df.groupby('label')['tweet'].count()\
              .reset_index(name='count') \
              .sort_values(['count'], ascending=False).reset_index(drop=True)

  label  count
0    na   6149
1   pos    288
2   neg    154